Конфигурация/InformationRegisters/ДоговорыСчетовДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыСчетовДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическаяПролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСрокаПролонгации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСрокаПролонгации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПролонгации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИнвестиционногоНалоговогоВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхНалоговыхВычетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЧувствительности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаскрытияИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаскрытияИнформацииОКонфликтеИнтересов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДоговорыБрокерскогоОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыБрокерскогоОбслуживания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВладельцаДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоговорыСчетовДоверительногоУправления/Ext/ManagerModule.bsl
#Область АктивностьДоговоровПоВидамДеятельности

Функция ПолучитьАктивностьДоговоровПоВидамДеятельности(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВЗапросАктивностьДоговоровПоВидамДеятельности(Запрос, Отбор);
	
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_АктивностьДоговоровПоВидамДеятельности").ПолучитьДанные().Выгрузить();
	
КонецФункции

Функция ПолучитьИзмененияВАктивностиДоговоровПоВидамДеятельности(Отбор, ПредыдущаяАктивностьДоговоровПоВидамДеятельности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ПредыдущаяАктивностьДоговоровПоВидамДеятельности", ПредыдущаяАктивностьДоговоровПоВидамДеятельности);
	
	ПоместитьВЗапросАктивностьДоговоровПоВидамДеятельности(Запрос, Отбор);
	ПоместитьВЗапросИзмененияВАктивностиДоговоровПоВидамДеятельности(Запрос);
	
	Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ИзмененияВАктивностиДоговоровПоВидамДеятельности").ПолучитьДанные().Выгрузить();
	
КонецФункции

Функция ПоместитьВЗапросАктивностьДоговоровПоВидамДеятельности(Запрос, Отбор)
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСчетовДоверительногоУправления.Период КАК Период,
		|	ДоговорыСчетовДоверительногоУправления.Организация КАК Организация,
		|	ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДоговорыСчетовДоверительногоУправления.Договор КАК Договор
		|ПОМЕСТИТЬ _ДоговорыСчетовДУ
		|ИЗ
		|	РегистрСведений.ДоговорыСчетовДоверительногоУправления КАК ДоговорыСчетовДоверительногоУправления
		|ГДЕ
		|	&ЭлементОтбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДоговорыСчетовДУ.Период КАК Период,
		|	ДоговорыСчетовДУ.Организация КАК Организация,
		|	ДоговорыСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДоговорыСчетовДУ.Договор КАК Договор
		|ПОМЕСТИТЬ _ПериодыДоговоров
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДоговорыСчетовДУ.Период КАК Период,
		|		_ДоговорыСчетовДУ.Организация КАК Организация,
		|		_ДоговорыСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ДоговорыСчетовДУ.Договор КАК Договор
		|	ИЗ
		|		_ДоговорыСчетовДУ КАК _ДоговорыСчетовДУ
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЛицензииДоговоровДоверительногоУправления.Период,
		|		_ДоговорыСчетовДУ.Организация,
		|		_ДоговорыСчетовДУ.СчетДоверительногоУправления,
		|		_ДоговорыСчетовДУ.Договор
		|	ИЗ
		|		_ДоговорыСчетовДУ КАК _ДоговорыСчетовДУ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|			ПО _ДоговорыСчетовДУ.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДоговорыСчетовДУ.Организация,
		|		_ДоговорыСчетовДУ.Договор,
		|		ЛицензииДоговоровДоверительногоУправления.Период,
		|		_ДоговорыСчетовДУ.СчетДоверительногоУправления
		|	
		|	ИМЕЮЩИЕ
		|		МИНИМУМ(_ДоговорыСчетовДУ.Период) <= ЛицензииДоговоровДоверительногоУправления.Период) КАК ДоговорыСчетовДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеПериодовСЛицензиями.Период КАК Период,
		|	_ДанныеПериодовСЛицензиями.Организация КАК Организация,
		|	_ДанныеПериодовСЛицензиями.Договор КАК Договор,
		|	ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности КАК ВидДеятельности
		|ПОМЕСТИТЬ _ПериодыДоговоровСВидамиДеятельности
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыДоговоровДоверительногоУправления.Период КАК Период,
		|		ПериодыДоговоровДоверительногоУправления.Организация КАК Организация,
		|		ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ПериодыДоговоровДоверительногоУправления.Договор КАК Договор,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия КАК Лицензия,
		|		МАКСИМУМ(ЛицензииДоговоровДоверительногоУправления.Период) КАК ПериодЛицензий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ПериодыДоговоров.Организация КАК Организация,
		|			_ПериодыДоговоров.Договор КАК Договор,
		|			_ПериодыДоговоров.Период КАК Период,
		|			ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(ДоговорыСчетовДоверительногоУправления.Период) КАК ПериодДоговоров
		|		ИЗ
		|			_ПериодыДоговоров КАК _ПериодыДоговоров
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления КАК ДоговорыСчетовДоверительногоУправления
		|				ПО _ПериодыДоговоров.Организация = ДоговорыСчетовДоверительногоУправления.Организация
		|					И _ПериодыДоговоров.Договор = ДоговорыСчетовДоверительногоУправления.Договор
		|					И _ПериодыДоговоров.Период >= ДоговорыСчетовДоверительногоУправления.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыДоговоров.Организация,
		|			_ПериодыДоговоров.Договор,
		|			_ПериодыДоговоров.Период,
		|			ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления) КАК ПериодыДоговоровДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления КАК ДоговорыСчетовДоверительногоУправления
		|			ПО ПериодыДоговоровДоверительногоУправления.Организация = ДоговорыСчетовДоверительногоУправления.Организация
		|				И ПериодыДоговоровДоверительногоУправления.Договор = ДоговорыСчетовДоверительногоУправления.Договор
		|				И ПериодыДоговоровДоверительногоУправления.СчетДоверительногоУправления = ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления
		|				И ПериодыДоговоровДоверительногоУправления.ПериодДоговоров = ДоговорыСчетовДоверительногоУправления.Период
		|				И (ДоговорыСчетовДоверительногоУправления.Активный)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|			ПО (ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления)
		|				И ПериодыДоговоровДоверительногоУправления.Период >= ЛицензииДоговоровДоверительногоУправления.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыДоговоровДоверительногоУправления.Организация,
		|		ПериодыДоговоровДоверительногоУправления.Договор,
		|		ПериодыДоговоровДоверительногоУправления.Период,
		|		ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия) КАК _ДанныеПериодовСЛицензиями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|		ПО _ДанныеПериодовСЛицензиями.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
		|			И _ДанныеПериодовСЛицензиями.ПериодЛицензий = ЛицензииДоговоровДоверительногоУправления.Период
		|			И _ДанныеПериодовСЛицензиями.Лицензия = ЛицензииДоговоровДоверительногоУправления.Лицензия
		|			И (ЛицензииДоговоровДоверительногоУправления.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыДоговоров.Период КАК Период,
		|	_ПериодыДоговоров.Организация КАК Организация,
		|	_ПериодыДоговоров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодыДоговоров.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДУ,
		|	_ПериодыДоговоров.Договор КАК Договор,
		|	_ПериодыДоговоров.Договор.ВидДоговора КАК ВидДоговора,
		|	_ПериодыДоговоров.Договор.НомерДоговора КАК НомерДоговора,
		|	_ВидыДеятельностиДоговоров.ВидДеятельности КАК ВидДеятельности,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия,
		|	_ПериодыДоговоровСВидамиДеятельности.ВидДеятельности ЕСТЬ НЕ NULL  КАК Активный,
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.НаименованиеЦелевогоКапитала КАК НаименованиеЦелевогоКапитала
		|ПОМЕСТИТЬ _АктивностьДоговоровПоВидамДеятельности
		|ИЗ
		|	_ПериодыДоговоров КАК _ПериодыДоговоров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_ПериодыДоговоровСВидамиДеятельности.Организация КАК Организация,
		|			_ПериодыДоговоровСВидамиДеятельности.Договор КАК Договор,
		|			_ПериодыДоговоровСВидамиДеятельности.ВидДеятельности КАК ВидДеятельности
		|		ИЗ
		|			_ПериодыДоговоровСВидамиДеятельности КАК _ПериодыДоговоровСВидамиДеятельности
		|		ГДЕ
		|			_ПериодыДоговоровСВидамиДеятельности.ВидДеятельности ЕСТЬ НЕ NULL ) КАК _ВидыДеятельностиДоговоров
		|		ПО _ПериодыДоговоров.Организация = _ВидыДеятельностиДоговоров.Организация
		|			И _ПериодыДоговоров.Договор = _ВидыДеятельностиДоговоров.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыДоговоровСВидамиДеятельности КАК _ПериодыДоговоровСВидамиДеятельности
		|		ПО _ПериодыДоговоров.Организация = _ПериодыДоговоровСВидамиДеятельности.Организация
		|			И _ПериодыДоговоров.Договор = _ПериодыДоговоровСВидамиДеятельности.Договор
		|			И _ПериодыДоговоров.Период = _ПериодыДоговоровСВидамиДеятельности.Период
		|			И (_ВидыДеятельностиДоговоров.ВидДеятельности = _ПериодыДоговоровСВидамиДеятельности.ВидДеятельности)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, ) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО _ПериодыДоговоров.Организация = СтратегииИндивидуальногоИнвестированияСрезПоследних.Организация
		|			И _ПериодыДоговоров.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(&Период, ) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних
		|		ПО _ПериодыДоговоров.Организация = УсловияДоговоровДоверительногоУправленияСрезПоследних.Организация
		|			И _ПериодыДоговоров.СчетДоверительногоУправления = УсловияДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления";
	
	УстановитьОтборПоДоговорам(Запрос, Отбор);
	
	Запрос.Выполнить();
	
КонецФункции

Функция ПоместитьВЗапросИзмененияВАктивностиДоговоровПоВидамДеятельности(Запрос)
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Период КАК Период,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Организация КАК Организация,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.ВидДоговораДУ КАК ВидДоговораДУ,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор КАК Договор,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.НомерДоговора КАК НомерДоговора,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.ВидДеятельности КАК ВидДеятельности,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Стратегия КАК Стратегия,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.НаименованиеЦелевогоКапитала КАК НаименованиеЦелевогоКапитала,
		|	ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Активный КАК Активный
		|ПОМЕСТИТЬ _ПредыдущаяАктивностьДоговоровПоВидамДеятельности
		|ИЗ
		|	&ПредыдущаяАктивностьДоговоровПоВидамДеятельности КАК ПредыдущаяАктивностьДоговоровПоВидамДеятельности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Период, _АктивностьДоговоровПоВидамДеятельности.Период) КАК Период,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Организация, _АктивностьДоговоровПоВидамДеятельности.Организация) КАК Организация,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.СчетДоверительногоУправления, _АктивностьДоговоровПоВидамДеятельности.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.ВидДоговораДУ, _АктивностьДоговоровПоВидамДеятельности.ВидДоговораДУ) КАК ВидДоговораДУ,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) КАК Договор,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БрокерскогоОбслуживания)
		|		КОГДА ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) КАК Справочник.Договоры).ВидДоговора
		|	КОНЕЦ КАК ВидДоговора,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.НомерДоговора, _АктивностьДоговоровПоВидамДеятельности.НомерДоговора) КАК НомерДоговора,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор, _АктивностьДоговоровПоВидамДеятельности.Договор) КАК Справочник.Договоры).Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.ВидДеятельности, _АктивностьДоговоровПоВидамДеятельности.ВидДеятельности) КАК ВидДеятельности,
		|	_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Активный ЕСТЬ NULL КАК НоваяСвязь,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Стратегия, _АктивностьДоговоровПоВидамДеятельности.Стратегия) КАК Стратегия,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.НаименованиеЦелевогоКапитала, _АктивностьДоговоровПоВидамДеятельности.НаименованиеЦелевогоКапитала) КАК НаименованиеЦелевогоКапитала,
		|	ЕСТЬNULL(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Активный, _АктивностьДоговоровПоВидамДеятельности.Активный) КАК Активный
		|ПОМЕСТИТЬ _ИзмененияВАктивностиДоговоровПоВидамДеятельности
		|ИЗ
		|	_АктивностьДоговоровПоВидамДеятельности КАК _АктивностьДоговоровПоВидамДеятельности
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ПредыдущаяАктивностьДоговоровПоВидамДеятельности КАК _ПредыдущаяАктивностьДоговоровПоВидамДеятельности
		|		ПО _АктивностьДоговоровПоВидамДеятельности.Организация = _ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Организация
		|			И _АктивностьДоговоровПоВидамДеятельности.Договор = _ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Договор
		|			И _АктивностьДоговоровПоВидамДеятельности.Период = _ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Период
		|			И _АктивностьДоговоровПоВидамДеятельности.ВидДеятельности = _ПредыдущаяАктивностьДоговоровПоВидамДеятельности.ВидДеятельности
		|			И _АктивностьДоговоровПоВидамДеятельности.Активный = _ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Активный
		|ГДЕ
		|	(_ПредыдущаяАктивностьДоговоровПоВидамДеятельности.Активный ЕСТЬ NULL
		|			ИЛИ _АктивностьДоговоровПоВидамДеятельности.Активный ЕСТЬ NULL)";
	
	Запрос.Выполнить();
	
КонецФункции

Процедура УстановитьОтборПоДоговорам(Запрос, Отбор)
	
	Запрос.УстановитьПараметр("ЭлементОтбора", Истина);
	
	//Значение периода по умолчанию
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Имя <> "Период"
			И ЭлементОтбора.Имя <> "Лицензия"
			И ЭлементОтбора.Использование Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭлементОтбора", "&ЭлементОтбора" + "
				|	И " + ЭлементОтбора.Имя + " В (&" + ЭлементОтбора.Имя + ")");
			Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
		ИначеЕсли ЭлементОтбора.Имя = "Период" 
			И ЭлементОтбора.Использование Тогда
			Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

Процедура ДобавитьСвязьДоговораИСчетаДоверительногоУправления(Период, Договор, СчетДоверительногоУправления, Отказ) Экспорт
	
	ДоговорыСчетовДУ = РегистрыСведений.ДоговорыСчетовДоверительногоУправления.СоздатьМенеджерЗаписи();
	ДоговорыСчетовДУ.Период							= Период; 
	ДоговорыСчетовДУ.СчетДоверительногоУправления	= СчетДоверительногоУправления;
	ДоговорыСчетовДУ.Договор						= Договор.Ссылка;
	ДоговорыСчетовДУ.Активный						= Истина;
	
	Попытка
		ДоговорыСчетовДУ.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка добавления связи договора со счетом в/у. Система сообщает: " + ОписаниеОшибки(), Договор.Ссылка,,, Отказ);
	КонецПопытки;
	
КонецПроцедуры

Функция ЕстьСвязьДоговораСоСчетомДоверительногоУправления(Период, Договор, Организация, СчетДоверительногоУправления) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.Активный КАК Активный
		|ИЗ
		|	РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Договор = &Договор
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних"); 
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("Договор",						Договор);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Активный;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
